{
  "articles": [
    {
      "title": "Local Volunteer Group Cleans Up Beach, Collects Over 500 Pounds of Trash",
      "description": "A dedicated team of volunteers spent the weekend removing plastic waste and debris from Sunshine Beach, making a significant environmental impact in just two days.",
      "imageUrl": "images/gallery/image1.jpg",
      "pubDate": "2023-11-05T09:30:00Z",
      "url": "#",
      "source": "Volunteer Connect"
    },
    {
      "title": "New Youth Mentorship Program Launches Next Month",
      "description": "The program will pair experienced volunteers with at-risk youth to provide guidance, support, and valuable life skills through weekly sessions and activities.",
      "imageUrl": "images/gallery/image2.jpeg",
      "pubDate": "2023-10-28T14:15:00Z",
      "url": "#",
      "source": "Volunteer Connect"
    },
    {
      "title": "Annual Food Drive Exceeds Donation Goals by 40%",
      "description": "Community members rallied to contribute non-perishable items, helping local food banks stock their shelves for the coming winter months when need is typically highest.",
      "imageUrl": "images/gallery/image3.jpeg",
      "pubDate": "2023-10-15T11:45:00Z",
      "url": "#",
      "source": "Volunteer Connect"
    },
    {
      "title": "Virtual Volunteering Opportunities Expand for Remote Helpers",
      "description": "New online platforms make it easier for people to contribute their skills from anywhere, from digital marketing to language translation for non-profit organizations.",
      "imageUrl": "images/gallery/image4.jpg",
      "pubDate": "2023-10-10T16:20:00Z",
      "url": "#",
      "source": "Volunteer Connect"
    },
    {
      "title": "Volunteer Spotlight: Maria Johnson's Decade of Service",
      "description": "After 10 years of dedicated community work, Maria reflects on her journey helping hundreds of seniors access essential services and maintain their independence.",
      "imageUrl": "images/gallery/image5.jpeg",
      "pubDate": "2023-09-28T10:00:00Z",
      "url": "#",
      "source": "Volunteer Connect"
    },
    {
      "title": "Local Businesses Partner with Schools for Career Mentorship Day",
      "description": "Professionals from various industries volunteered to speak with high school students about career paths, education requirements, and workplace expectations.",
      "imageUrl": "images/gallery/image1.jpg",
      "pubDate": "2023-09-22T13:40:00Z",
      "url": "#",
      "source": "Volunteer Connect"
    }
  ]
} 